lib/tasks/send_leaderboard_by_email.rake

  task email: :environment do
    loop do
      @users = User.all
---
SELECT "users".* FROM "users"