app/controllers/games_controller.rb

SELECT "games".* FROM "games" ORDER BY "games"."played_at" ASC
---
  def index
    @games = Game.order(played_at: :desc).all

INSERT INTO "games" ("player_id", "opponent_id", "player_score", "opponent_score", "played_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)

    if @game.save

UPDATE "games" SET "player_score" = ?, "opponent_score" = ?, "played_at" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_score", 21], ["opponent_score", 19], ["played_at", "2019-04-30 23:38:53"], ["updated_at", "2019-03-30 20:54:30.170806"], ["id", 1]]
---
  def update
    if @game.update(game_params)

DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
---
  def destroy
    @game.destroy