app/controllers/users_controller.rb

  def index
    @users = User.order(rank: :desc).all
---
SELECT "users".* FROM "users" ORDER BY "users"."rank" DESC

  def find_user
    @user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]