app/models/game.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "rank" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["rank", 15], ["updated_at", "2019-03-30 22:57:11.259139"], ["id", 1]]
UPDATE "users" SET "rank" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["rank", -15], ["updated_at", "2019-03-30 22:57:11.262462"], ["id", 2]]
---
  def update_rank
    @player = User.find_by id: player_id
    @opponent = User.find_by id: opponent_id

    new_ranks = calculate_new_raitings(@player.rank, @opponent.rank, player_score, opponent_score)

    @player.rank = new_ranks.first
    @opponent.rank = new_ranks.last

    @player.save
    @opponent.save